## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the alias `pd`.

In [49]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [50]:
pd.__version__

'0.24.2'

**3.** Print out all the *version* information of the libraries that are required by the pandas library.

In [51]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.7.3.final.0
python-bits: 64
OS: Windows
OS-release: 10
machine: AMD64
processor: Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.24.2
pytest: 5.0.1
pip: 19.1.1
setuptools: 41.0.1
Cython: 0.29.12
numpy: 1.16.4
scipy: 1.2.1
pyarrow: None
xarray: None
IPython: 7.6.1
sphinx: 2.1.2
patsy: 0.5.1
dateutil: 2.8.0
pytz: 2019.1
blosc: None
bottleneck: 1.2.1
tables: 3.5.2
numexpr: 2.6.9
feather: None
matplotlib: 3.1.0
openpyxl: 2.6.2
xlrd: 1.2.0
xlwt: 1.3.0
xlsxwriter: 1.1.8
lxml.etree: 4.3.4
bs4: 4.7.1
html5lib: 1.0.1
sqlalchemy: 1.3.5
pymysql: None
psycopg2: None
jinja2: 2.10.1
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: None
gcsfs: None

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [52]:
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data)
df['labels'] = labels
print(df.set_index('labels'))

       animal  age  visits priority
labels
a         cat  2.5       1      yes
b         cat  3.0       3      yes
c       snake  0.5       2       no
d         dog  NaN       3      yes
e         dog  5.0       2       no
f         cat  2.0       3       no
g       snake  4.5       1       no
h         cat  NaN       1      yes
i         dog  7.0       2       no
j         dog  3.0       1       no

**5.** Display a summary of the basic information about this DataFrame and its data (*hint: there is a single method that can be called on the DataFrame*).

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
labels      10 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 480.0+ bytes

**6.** Return the first 3 rows of the DataFrame `df`.

In [54]:
df[:3]

  animal  age  visits priority labels
0    cat  2.5       1      yes      a
1    cat  3.0       3      yes      b
2  snake  0.5       2       no      c

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [55]:
df[['animal', 'age']]

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [8]:
df.loc[[3,4,8],['animal', 'age']]

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

**9.** Select only the rows where the number of visits is greater than 3.

In [9]:
df [ df['visits'] > 3 ]

Empty DataFrame
Columns: [animal, age, visits, priority, labels]
Index: []

**10.** Select the rows where the age is missing, i.e. it is `NaN`.

In [56]:
df[ df['age'].isnull() ]

  animal  age  visits priority labels
3    dog  NaN       3      yes      d
7    cat  NaN       1      yes      h

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [57]:
df[ ((df['animal'] == 'cat') & (df['age'] < 3)) ]

  animal  age  visits priority labels
0    cat  2.5       1      yes      a
5    cat  2.0       3       no      f

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [58]:
df[ (df['age'] >= 2) & (df['age'] <= 4) ]

  animal  age  visits priority labels
0    cat  2.5       1      yes      a
1    cat  3.0       3      yes      b
5    cat  2.0       3       no      f
9    dog  3.0       1       no      j

**13.** Change the age in row 'f' to 1.5.

In [59]:
df.set_index('labels', inplace=True)

In [60]:
df.iat[5,1] = 1.5
df

       animal  age  visits priority
labels
a         cat  2.5       1      yes
b         cat  3.0       3      yes
c       snake  0.5       2       no
d         dog  NaN       3      yes
e         dog  5.0       2       no
f         cat  1.5       3       no
g       snake  4.5       1       no
h         cat  NaN       1      yes
i         dog  7.0       2       no
j         dog  3.0       1       no

**14.** Calculate the sum of all visits in `df` (i.e. find the total number of visits).

In [61]:
df['visits'].sum()

19

**15.** Calculate the mean age for each different animal in `df`.

In [62]:
cat = df[ df['animal'] == 'cat' ]
python = df[ df['animal'] == 'python' ]
dog = df[ df['animal'] == 'dog' ]

print("cat: " + str(cat['age'].mean()))
print("python: " + str(python['age'].mean()))
print("dog: " + str(dog['age'].mean()))

df.groupby('animal')['age'].mean()

cat: 2.3333333333333335
python: nan
dog: 5.0

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [17]:
df['k'] = 1
print(df)
df.drop('k', axis=1, inplace=True)
print(df)

       animal  age  visits priority  k
labels
a         cat  2.5       1      yes  1
b         cat  3.0       3      yes  1
c       snake  0.5       2       no  1
d         dog  NaN       3      yes  1
e         dog  5.0       2       no  1
f         cat  1.5       3       no  1
g       snake  4.5       1       no  1
h         cat  NaN       1      yes  1
i         dog  7.0       2       no  1
j         dog  3.0       1       no  1
       animal  age  visits priority
labels
a         cat  2.5       1      yes
b         cat  3.0       3      yes
c       snake  0.5       2       no
d         dog  NaN       3      yes
e         dog  5.0       2       no
f         cat  1.5       3       no
g       snake  4.5       1       no
h         cat  NaN       1      yes
i         dog  7.0       2       no
j         dog  3.0       1       no

**17.** Count the number of each type of animal in `df`.

In [18]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visits' column in *ascending* order (so row `i` should be first, and row `d` should be last).

In [66]:
print(df.sort_values(by=[ 'age','visits'],ascending=[False, True]  ))

       animal  age  visits priority
labels
i         dog  7.0       2       no
e         dog  5.0       2       no
g       snake  4.5       1       no
j         dog  3.0       1       no
b         cat  3.0       3      yes
a         cat  2.5       1      yes
f         cat  1.5       3       no
c       snake  0.5       2       no
h         cat  NaN       1      yes
d         dog  NaN       3      yes

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [20]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})
df['priority']

labels
a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [21]:
df.loc[ (df['animal'] == 'snake'), 'animal'] = 'python'
df

        animal  age  visits  priority
labels
a          cat  2.5       1      True
b          cat  3.0       3      True
c       python  0.5       2     False
d          dog  NaN       3      True
e          dog  5.0       2     False
f          cat  1.5       3     False
g       python  4.5       1     False
h          cat  NaN       1      True
i          dog  7.0       2     False
j          dog  3.0       1     False

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (*hint: use a pivot table*).

In [22]:
table = pd.pivot_table(df, values = "age", index = ['animal', 'visits'], aggfunc = np.mean)
table

                age
animal visits
cat    1       2.50
       3       2.25
dog    1       3.00
       2       6.00
python 1       4.50
       2       0.50

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

```python
1, 2, 3, 4, 5, 6, 7
```

In [23]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df = df.drop_duplicates()
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [24]:
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values

print(df)
print()
print(df.mean(axis=1))
print()
print( df.sub(df.mean(axis=1), axis=0))

          0         1         2
0  0.116436  0.427702  0.120176
1  0.358437  0.478161  0.884190
2  0.672969  0.968098  0.755227
3  0.724178  0.942685  0.018855
4  0.049070  0.195049  0.931974

0    0.221438
1    0.573596
2    0.798765
3    0.561906
4    0.392031
dtype: float64

          0         1         2
0 -0.105002  0.206264 -0.101262
1 -0.215159 -0.095435  0.310594
2 -0.125796  0.169333 -0.043537
3  0.162272  0.380779 -0.543051
4 -0.342961 -0.196982  0.539943

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum?  Return that column's label.

In [25]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

columns = df.sum(axis=0)
columns.sort_values().head(1)

a    1.502103
dtype: float64

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)? As input, use a DataFrame of zeros and ones with 10 rows and 3 columns.

```python
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
```

In [81]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
print(df.nunique().sum())
print()

print(df)
print()
print(df.drop_duplicates())

len(df.drop_duplicates())

5

   0  1  2
0  1  0  1
1  1  1  1
2  1  1  1
3  1  0  1
4  0  0  1
5  1  1  1
6  0  1  1
7  1  0  1
8  1  1  1
9  0  1  1

   0  1  2
0  1  0  1
1  1  1  1
4  0  0  1
6  0  1  1

4

The next three puzzles are slightly harder.


**26.** In the cell below, you have a DataFrame `df` that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values. 

For each row of the DataFrame, find the *column* which contains the *third* NaN value.

You should return a Series of column labels: `e, c, d, h, d`

In [27]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

# write a solution to the question here
(df.isnull().cumsum(axis=1)==3).idxmax(axis=1)

0    e
1    c
2    d
3    h
4    d
dtype: object

**27.** A DataFrame has a column of groups 'grps' and and column of integer values 'vals': 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values. You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [28]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

# write a solution to the question here
a = df[ df['grps'] == 'a']['vals'].sort_values(ascending=False)

b = df[ df['grps'] == 'b']['vals'].sort_values(ascending=False)

c = df[ df['grps'] == 'c']['vals'].sort_values(ascending=False)

print('a: ' + str(a.head(3).sum()))
print('b: ' + str(b.head(3).sum()))
print('c: ' + str(c.head(3).sum()))

print()
sorted = df.sort_values(by='vals', ascending=False).groupby('grps').head(3)
sorted.groupby('grps')['vals'].sum()

a: 409
b: 156
c: 345

grps
a    409
b    156
c    345
Name: vals, dtype: int64

**28.** The DataFrame `df` constructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). 

For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

The answer should be a Series as follows:

```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [48]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, size=(100, 2)), columns = ["A", "B"])

# write a solution to the question here
df.cut()

## DataFrames: harder problems 

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**29.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be 

```
[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]
```

Make this a new column 'Y'.

**30.** Consider the DataFrame constructed below which contains rows and columns of numerical data. 

Create a list of the column-row index locations of the 3 largest values in this DataFrame. In this case, the answer should be:
```
[(5, 7), (6, 4), (2, 5)]
```

In [30]:
df = pd.DataFrame(np.random.RandomState(30).randint(1, 101, size=(8, 8)))

**31.** You are given the DataFrame below with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals'.

```python
df = pd.DataFrame({"vals": np.random.RandomState(31).randint(-30, 30, size=15), 
                   "grps": np.random.RandomState(31).choice(["A", "B"], 15)})
```

Create a new column 'patched_values' which contains the same values as the 'vals' any negative values in 'vals' with the group mean:

```
    vals grps  patched_vals
0    -12    A          13.6
1     -7    B          28.0
2    -14    A          13.6
3      4    A           4.0
4     -7    A          13.6
5     28    B          28.0
6     -2    A          13.6
7     -1    A          13.6
8      8    A           8.0
9     -2    B          28.0
10    28    A          28.0
11    12    A          12.0
12    16    A          16.0
13   -24    A          13.6
14   -12    A          13.6
```

**32.** Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

pandas is fantastic for working with dates and times. These puzzles explore some of this functionality.

**33.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

In [31]:
year_2015 = pd.date_range(start = '1/1/2015', end = '12/31/2015', freq='B')
s = pd.Series(np.random.rand(len(year_2015)), index=year_2015)
s

2015-01-01    0.271988
2015-01-02    0.679775
2015-01-05    0.922547
2015-01-06    0.702376
2015-01-07    0.523537
2015-01-08    0.552553
2015-01-09    0.774231
2015-01-12    0.641570
2015-01-13    0.091628
2015-01-14    0.339152
2015-01-15    0.900575
2015-01-16    0.392788
2015-01-19    0.486605
2015-01-20    0.639867
2015-01-21    0.468317
2015-01-22    0.077406
2015-01-23    0.966300
2015-01-26    0.775462
2015-01-27    0.963325
2015-01-28    0.168789
2015-01-29    0.296578
2015-01-30    0.303974
2015-02-02    0.802140
2015-02-03    0.633707
2015-02-04    0.055393
2015-02-05    0.000853
2015-02-06    0.157089
2015-02-09    0.784634
2015-02-10    0.607390
2015-02-11    0.038966
                ...
2015-11-20    0.692490
2015-11-23    0.521109
2015-11-24    0.798300
2015-11-25    0.931018
2015-11-26    0.915830
2015-11-27    0.911024
2015-11-30    0.579601
2015-12-01    0.585923
2015-12-02    0.015054
2015-12-03    0.757308
2015-12-04    0.826809
2015-12-07    0.276233
2015-12-08    0.136492
2015-12-09    0.328367
2015-12-10    0.609166
2015-12-11    0.884944
2015-12-14    0.532969
2015-12-15    0.603850
2015-12-16    0.541946
2015-12-17    0.404364
2015-12-18    0.605584
2015-12-21    0.161095
2015-12-22    0.083390
2015-12-23    0.906907
2015-12-24    0.245921
2015-12-25    0.666116
2015-12-28    0.448398
2015-12-29    0.869582
2015-12-30    0.034851
2015-12-31    0.552519
Freq: B, Length: 261, dtype: float64

**34.** Find the sum of the values in `s` for every Wednesday.

In [32]:
s[ (s.index.weekday == 2) ].sum()

26.20226440809486

**35.** For each calendar month in `s`, find the mean of values.

In [33]:
s.groupby(s.index.month).mean()

1     0.542697
2     0.488751
3     0.521971
4     0.434466
5     0.503574
6     0.594470
7     0.393218
8     0.528083
9     0.419309
10    0.497618
11    0.580246
12    0.481643
dtype: float64

**36.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

In [85]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-23
2015-05-31   2015-03-13
2015-09-30   2015-08-05
2016-01-31   2015-11-19
Freq: 4M, dtype: datetime64[ns]

**37.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [35]:
thursdays = pd.date_range(start = '1/15/2015', end = '12/15/2016', freq='WOM-3THU')
thursdays

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```
Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```


(It's some flight data I made up; it's not meant to be accurate in any way.)

**38.** Some values in the the **FlightNumber** column are missing (they are `NaN`). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify `df` to fill in these missing numbers and make the column an integer column (instead of a float column).

In [36]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

df['FlightNumber']
df.iat[1, 1] = 10055
df.iat[3, 1] = 10075
df['FlightNumber'] = df['FlightNumber'].astype(int)

type(df['FlightNumber'][0])

numpy.int32

**39.** The **From\_To** column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame called 'temp' with the correct values. Assign the correct column names 'From' and 'To' to this temporary DataFrame.

In [37]:
#df[['From','To']] = df.From_To.str.split("_")
temp = df.From_To.str.split("_",expand=True)
temp.rename(columns = {0:'From', 1: 'To'}, inplace = True)
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**40.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame 'temp'. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [38]:
temp["From"] = temp["From"].apply(lambda x: x.capitalize())
temp["To"] = temp["To"].apply(lambda x: x.capitalize() )
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**41.** Delete the **From_To** column from `df` and attach the temporary DataFrame 'temp' from the previous questions.

In [39]:
df.drop("From_To", inplace=True, axis=1)

In [40]:
df = pd.concat([df, temp], axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

**42**. In the **Airline** column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [41]:
df['Airline'] = df['Airline'].str.replace('[^\w\s]','')
df['Airline'] = df['Airline'].str.replace('12','')
df

   FlightNumber  RecentDelays           Airline      From         To
0         10045      [23, 47]               KLM    London      Paris
1         10055            []       Air France     Madrid      Milan
2         10065  [24, 43, 87]  British Airways     London  Stockholm
3         10075          [13]        Air France  Budapest      Paris
4         10085      [67, 32]         Swiss Air  Brussels     London

**43**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`.

In [42]:
df3 = pd.DataFrame(df['RecentDelays'].tolist(), columns=['delay_1', 'delay_2', 'delay_3'])

In [43]:
df.drop('RecentDelays', inplace=True, axis=1)
pd.concat([df, df3], axis=1)

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

The DataFrame should look much better now.
```
   FlightNumber          Airline      From         To  delay_1  delay_2  delay_3
0         10045              KLM    London      Paris     23.0     47.0      NaN
1         10055       Air France    Madrid      Milan      NaN      NaN      NaN
2         10065  British Airways    London  Stockholm     24.0     43.0     87.0
3         10075       Air France  Budapest      Paris     13.0      NaN      NaN
4         10085        Swiss Air  Brussels     London     67.0     32.0      NaN
```